{
  "name": "Adarsh N B",
  "contact": {
    "phone": "+91 9623599354",
    "email": "adarshnb@gmail.com",
    "linkedin": "linkedin.com/in/adarshnb",
    "github": "github.com/digitaltracer"
  },
  "education": [
    {
      "university": "BITS Pilani Goa Campus",
      "location": "Goa, India",
      "degree": "Bachelor of Technology",
      "date": "2014"
    }
  ],
  "summary": "Backend-focused software engineer with 9+ years of experience designing and scaling distributed systems. Proven expertise in Kafka, asynchronous processing, system observability, and cross-functional collaboration. Passionate about simplifying complex infrastructure through clean code and robust design.",
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Docket AI",
      "location": "Bangalore, India",
      "dates": "May 2024 - Present",
      "responsibilities": [
        "Integrated with 8+ third-party platforms (e.g., Salesforce, Highspot) to enhance cross-system data ingestion, increasing sync reliability by 40%.",
        "Redesigned the core platform architecture to accommodate growing customer demand, reducing latency by 30% and improving scalability.",
        "Developed a standardized Kafka and logging library adopted across all microservices, minimizing code duplication and simplifying onboarding.",
        "Implemented a centralized observability stack using Prometheus and EFK, cutting incident resolution time by 50% through real-time alerting and dashboards."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Inflection.io",
      "location": "Bangalore, India",
      "dates": "Apr 2022 - Sep 2023",
      "responsibilities": [
        "Created a campaign control system to process millions of data points and dynamically determine stopping criteria, improving targeting effectiveness and resource utilization.",
        "Led development of high-impact features including 100x faster email tracking, bulk contact uploads, and CRM integrations (Salesforce, Segment), improving campaign performance and customer experience.",
        "Designed and deployed a Dead Letter Queue (DLQ) mechanism to isolate and monitor Kafka stream errors, improving pipeline reliability and error traceability.",
        "Mentored junior engineers, conducted code/design reviews, and led delivery of multiple cross-functional initiatives."
      ]
    },
    {
      "title": "Senior Product Engineer",
      "company": "FullContact",
      "location": "Kochi, India",
      "dates": "Jan 2021 - Mar 2022",
      "responsibilities": [
        "Contributed to the Identity Graph team managing over 1B entities and 10B data points, enhancing entity resolution quality across 10+ products.",
        "Built custom data visualization tools for debugging identity anomalies, reducing investigation time by 60%.",
        "Automated and maintained several dependent data workflows, improving operational efficiency and reducing manual intervention."
      ]
    },
    {
      "title": "Team Lead - Data Pipeline",
      "company": "FullContact",
      "location": "Kochi, India",
      "dates": "Apr 2019 - Dec 2020",
      "responsibilities": [
        "Led a 3-person Big Data Engineering team responsible for the batch enrichment pipeline, enabling identity resolution for B2B customers.",
        "Oversaw hiring, agile planning, and delivery cycles as team lead and SCRUM master, improving velocity and cross-team alignment.",
        "Improved pipeline throughput by 10x by optimizing Spark jobs, storage patterns, and job orchestration.",
        "Designed and deployed full automation of the enrichment pipeline, allowing customer-triggered processing with zero manual steps."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "FullContact",
      "location": "Kochi, India",
      "dates": "Jan 2016 - Mar 2019",
      "responsibilities": [
        "Developed REST APIs using Flask for FullContact's identity enrichment platform, improving service modularity and scaling backend systems.",
        "Built a ReactJS-based internal dashboard and Chrome extension to help users detect and resolve conflicting graph data, increasing analyst productivity."
      ]
    },
    {
      "title": "Algorithms Engineer",
      "company": "ZLemma",
      "location": "Pune, India",
      "dates": "Apr 2014 - Sept 2015",
      "responsibilities": [
        "Designed and implemented entity extraction algorithms for names, emails, phone numbers, and date formats from unstructured documents.",
        "Developed logic to classify resume sections even with ambiguous or missing headings.",
        "Assisted in decomposing a monolithic system into microservices for improved scalability."
      ]
    }
  ],
  "projects": [
    {
      "name": "json-resume",
      "technologies": ["Python", "Playwright", "Langchain"],
      "date": "June 2025",
      "description": [
        "Developed a tool to generate a resume from a JSON file using Playwright using a defined template",
        "Used Langchain to generate job matching score for a job description and a resume"
      ]
    },
    {
      "name": "Serenity Notes",
      "technologies": ["Typescript", "React", "TailwindCSS", "React Native"],
      "date": "July 2025 - Present",
      "description": [
        "A cross-platform desktop productivity application using Electron, React, and TypeScript. Managed the project within a Turborepo monorepo, creating shared packages for UI components, core business logic, and database management to ensure code consistency and streamlined development.",
        "A comprehensive security framework featuring end-to-end encryption (E2EE) for all user data, secure local storage leveraging system-level keychain/keystore, and biometric authentication. These measures were designed to guarantee user privacy and data integrity",
        "Developed a suite of productivity features including project/task management, goal tracking, and a rich-text journaling system. Enhanced usability and user engagement by building interactive elements such as drag-and-drop interfaces, customizable keyboard shortcuts, and advanced data visualizations like burndown charts and heatmaps.",
        "A service to securely connect with and sync data from third-party platforms, including initial integrations for GitHub and Google Calendar. This allowed users to consolidate external tasks and events directly within the application, creating a unified productivity hub"
      ]
    }
  ],
  "skills": {
    "Languages": [
      "Python",
      "Java",
      "Scala",
      "TypeScript",
      "JavaScript",
      "SQL",
      "NoSQL"
    ],
    "Soft Skills": [
      "Team Leadership",
      "Cross-functional Collaboration",
      "Technical Mentorship",
      "Project Management",
      "Analytical Thinking"
    ],
    "Others": [
      "AWS & Cloud Infrastructure",
      "CI/CD (GitHub Actions, Jenkins)",
      "Monitoring (Prometheus, Grafana, EFK)",
      "Kubernetes & Docker",
      "Apache Kafka & Airflow",
      "Spark & Distributed Data Processing"
    ]
  }
}
